In [1]:
import pandas as pd

In [15]:
ser=pd.Series(['34','10',900,450,432],['Ram','Hari','Sita','Suju','pradip'])

In [16]:
print(ser)

Ram        34
Hari       10
Sita      900
Suju      450
pradip    432
dtype: object

In [17]:
ser.index

Index(['Ram', 'Hari', 'Sita', 'Suju', 'pradip'], dtype='object')

In [20]:
ser[[1,4]]

Hari       10
pradip    432
dtype: object

In [21]:
ser.iloc[2]

900

In [24]:
calories = pd.Series({"day1": 420, "day2": 380, "day3": 390})

In [25]:
calories

day1    420
day2    380
day3    390
dtype: int64

In [27]:
ser[[1]]*10

Hari    10101010101010101010
dtype: object

# Dataframes

In [38]:
a={'one':pd.Series([10,20,30,40,50,60], index=['a','b','c','d','e','f']),
  'two':pd.Series([-10,-20,-30,-20,-10,-5], index=['a','b','c','d','e','f'])
  }

In [42]:
df=pd.DataFrame(a)

In [43]:
df

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40  -20
e   50  -10
f   60   -5

In [50]:
new = {
  "a": [1, 2, 3],
  "b": [4, 5, 6]
}
df = pd.DataFrame(new, index = ["S1", "S2", "S3"])

In [51]:
print(df)

    a  b
S1  1  4
S2  2  5
S3  3  6

In [61]:
a={'Nepali':pd.Series([34,43,56,54,50,60], index=['hari','sita','ram','gita','namita','papita']),
  'English':pd.Series([43,32,46,67,70,56], index=['hari','sita','ram','gita','namita','papita']),
   'Science':pd.Series([78,77,50,50,70,69], index=['hari','sita','ram','gita','namita','papita'])
  }

In [62]:
ad=pd.DataFrame(a)

In [63]:
ad

        Nepali  English  Science
hari        34       43       78
sita        43       32       77
ram         56       46       50
gita        54       67       50
namita      50       70       70
papita      60       56       69

In [64]:
ad.loc[['hari']]

      Nepali  English  Science
hari      34       43       78

In [90]:
b={"Nepali":[34,43,56,54,50,60],
  "English":[43,32,46,67,70,56],
   "Science":[78,77,50,50,70,69]
  }

In [91]:
db=pd.DataFrame(b,index=['hari','sita','ram','gita','namita','papita'])

In [92]:
db

        Nepali  English  Science
hari        34       43       78
sita        43       32       77
ram         56       46       50
gita        54       67       50
namita      50       70       70
papita      60       56       69

In [69]:
bc={"Nepali":pd.Series([34,43,56,54,50,60]),
  "English":pd.Series([43,32,46,67,70,56]),
   "Science":pd.Series([78,77,50,50,70,69])
  }

In [79]:
dbc=pd.DataFrame(bc,index=['hari','sita','ram','gita','namita','papita'])

In [80]:
dbc

        Nepali  English  Science
hari       NaN      NaN      NaN
sita       NaN      NaN      NaN
ram        NaN      NaN      NaN
gita       NaN      NaN      NaN
namita     NaN      NaN      NaN
papita     NaN      NaN      NaN

In [83]:
df2=pd.DataFrame(bc,columns=['Nepali','Science'])

In [84]:
df2

   Nepali  Science
0      34       78
1      43       77
2      56       50
3      54       50
4      50       70
5      60       69

In [93]:
b={"Nepali":[34,43,56,54,50,60],
  "English":[43,32,46,67,70,56],
   "Science":[78,77,50,50,70,69]
  }

In [107]:
marks=pd.DataFrame(b,index=['hari','sita','ram','gita','namita','papita'], columns=['Nepali','English','Science'])

In [108]:
marks

        Nepali  English  Science
hari        34       43       78
sita        43       32       77
ram         56       46       50
gita        54       67       50
namita      50       70       70
papita      60       56       69

# Head & Tail

In [98]:
type(marks)

pandas.core.frame.DataFrame

In [99]:
marks.tail() #last 5 data

        Nepali  English  Science
sita        43       32       77
ram         56       46       50
gita        54       67       50
namita      50       70       70
papita      60       56       69

In [100]:
marks.head() #first 5 datas

        Nepali  English  Science
hari        34       43       78
sita        43       32       77
ram         56       46       50
gita        54       67       50
namita      50       70       70